In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
male_data=pd.read_csv(r"C:\Users\PIYUSH\Desktop\gender_male\m_names.csv")

In [3]:
male_data.describe()

          name gender    race
count    14821  14845   14845
unique    8519      1       1
top     deepak      m  indian
freq       135  14845   14845

In [4]:
male_data.dropna(subset=["name"],inplace=True)

In [5]:
male_data.describe()

          name gender    race
count    14821  14821   14821
unique    8519      1       1
top     deepak      m  indian
freq       135  14821   14821

In [6]:
male_data.shape

(14821, 3)

In [7]:
male_data.drop_duplicates(subset=["name"],keep=False,inplace=True)

In [8]:
male_data.describe()

          name gender    race
count     7159   7159    7159
unique    7159      1       1
top     ramdas      m  indian
freq         1   7159    7159

In [9]:
f_data=pd.read_csv(r"C:\Users\PIYUSH\Desktop\gender_female\f_names.csv")

In [10]:
f_data.shape

(15382, 3)

In [11]:
f_data.describe()

         name gender    race
count   15351  15382   15382
unique   6773      1       1
top     pooja      f  indian
freq      346  15382   15382

In [12]:
f_data.isnull().sum()

name      31
gender     0
race       0
dtype: int64

In [13]:
f_data.dropna(subset=["name"],inplace=True)

In [14]:
f_data.drop_duplicates(subset=["name"],keep=False,inplace=True)

In [15]:
f_data.shape

(5578, 3)

In [46]:
import string as st
al=st.ascii_lowercase +"@"
j=-1
ls=[]
for i in male_data.name:
    j+=1
    if(not(i[0] in al)):
        ls.append(j)

In [52]:
import string as st
al=st.ascii_lowercase +"@"
j=-1
ls1=[]
for i in f_data.name:
    j+=1
    if(not(i[0] in al)):
        ls1.append(j)

In [56]:
male_data.drop(male_data.index[ls],inplace=True)

In [61]:
male_data.shape

(7115, 3)